espressif/esp-idf/components/soc/esp32h4/register/soc/cache_reg.h
/** CACHE_L1_IBUS0_ACS_MISS_CNT_REG register
 *  L1-ICache bus0 Miss-Access Counter register
 */
#define CACHE_L1_IBUS0_ACS_MISS_CNT_REG (DR_REG_CACHE_BASE + 0x188)
/** CACHE_L1_IBUS0_MISS_CNT : RO; bitpos: [31:0]; default: 0;
 *  The register records the number of missing when bus0 accesses L1-ICache0.
 */
#define CACHE_L1_IBUS0_MISS_CNT    0xFFFFFFFFU
#define CACHE_L1_IBUS0_MISS_CNT_M  (CACHE_L1_IBUS0_MISS_CNT_V << CACHE_L1_IBUS0_MISS_CNT_S)
#define CACHE_L1_IBUS0_MISS_CNT_V  0xFFFFFFFFU
#define CACHE_L1_IBUS0_MISS_CNT_S  0

/** CACHE_L1_IBUS0_ACS_CONFLICT_CNT_REG register
 *  L1-ICache bus0 Conflict-Access Counter register
 */
#define CACHE_L1_IBUS0_ACS_CONFLICT_CNT_REG (DR_REG_CACHE_BASE + 0x18c)
/** CACHE_L1_IBUS0_CONFLICT_CNT : RO; bitpos: [31:0]; default: 0;
 *  The register records the number of access-conflicts when bus0 accesses L1-ICache0.
 */
#define CACHE_L1_IBUS0_CONFLICT_CNT    0xFFFFFFFFU
#define CACHE_L1_IBUS0_CONFLICT_CNT_M  (CACHE_L1_IBUS0_CONFLICT_CNT_V << CACHE_L1_IBUS0_CONFLICT_CNT_S)
#define CACHE_L1_IBUS0_CONFLICT_CNT_V  0xFFFFFFFFU
#define CACHE_L1_IBUS0_CONFLICT_CNT_S  0

/** CACHE_L1_IBUS0_ACS_NXTLVL_RD_CNT_REG register
 *  L1-ICache bus0 Next-Level-Access Counter register
 */
#define CACHE_L1_IBUS0_ACS_NXTLVL_RD_CNT_REG (DR_REG_CACHE_BASE + 0x190)
/** CACHE_L1_IBUS0_NXTLVL_RD_CNT : RO; bitpos: [31:0]; default: 0;
 *  The register records the number of times that L1-ICache accesses L2-Cache due to
 *  bus0 accessing L1-ICache0.
 */
#define CACHE_L1_IBUS0_NXTLVL_RD_CNT    0xFFFFFFFFU
#define CACHE_L1_IBUS0_NXTLVL_RD_CNT_M  (CACHE_L1_IBUS0_NXTLVL_RD_CNT_V << CACHE_L1_IBUS0_NXTLVL_RD_CNT_S)
#define CACHE_L1_IBUS0_NXTLVL_RD_CNT_V  0xFFFFFFFFU
#define CACHE_L1_IBUS0_NXTLVL_RD_CNT_S  0

/** CACHE_L1_IBUS1_ACS_HIT_CNT_REG register
 *  L1-ICache bus1 Hit-Access Counter register
 */
#define CACHE_L1_IBUS1_ACS_HIT_CNT_REG (DR_REG_CACHE_BASE + 0x194)
/** CACHE_L1_IBUS1_HIT_CNT : RO; bitpos: [31:0]; default: 0;
 *  The register records the number of hits when bus1 accesses L1-ICache1.
 */
#define CACHE_L1_IBUS1_HIT_CNT    0xFFFFFFFFU
#define CACHE_L1_IBUS1_HIT_CNT_M  (CACHE_L1_IBUS1_HIT_CNT_V << CACHE_L1_IBUS1_HIT_CNT_S)
#define CACHE_L1_IBUS1_HIT_CNT_V  0xFFFFFFFFU
#define CACHE_L1_IBUS1_HIT_CNT_S  0

/** CACHE_L1_IBUS1_ACS_MISS_CNT_REG register
 *  L1-ICache bus1 Miss-Access Counter register
 */
#define CACHE_L1_IBUS1_ACS_MISS_CNT_REG (DR_REG_CACHE_BASE + 0x198)
/** CACHE_L1_IBUS1_MISS_CNT : RO; bitpos: [31:0]; default: 0;
 *  The register records the number of missing when bus1 accesses L1-ICache1.
 */
#define CACHE_L1_IBUS1_MISS_CNT    0xFFFFFFFFU
#define CACHE_L1_IBUS1_MISS_CNT_M  (CACHE_L1_IBUS1_MISS_CNT_V << CACHE_L1_IBUS1_MISS_CNT_S)
#define CACHE_L1_IBUS1_MISS_CNT_V  0xFFFFFFFFU
#define CACHE_L1_IBUS1_MISS_CNT_S  0

/** CACHE_L1_IBUS1_ACS_CONFLICT_CNT_REG register
 *  L1-ICache bus1 Conflict-Access Counter register
 */
#define CACHE_L1_IBUS1_ACS_CONFLICT_CNT_REG (DR_REG_CACHE_BASE + 0x19c)
/** CACHE_L1_IBUS1_CONFLICT_CNT : RO; bitpos: [31:0]; default: 0;
 *  The register records the number of access-conflicts when bus1 accesses L1-ICache1.
 */
#define CACHE_L1_IBUS1_CONFLICT_CNT    0xFFFFFFFFU
#define CACHE_L1_IBUS1_CONFLICT_CNT_M  (CACHE_L1_IBUS1_CONFLICT_CNT_V << CACHE_L1_IBUS1_CONFLICT_CNT_S)
#define CACHE_L1_IBUS1_CONFLICT_CNT_V  0xFFFFFFFFU
#define CACHE_L1_IBUS1_CONFLICT_CNT_S  0

/** CACHE_L1_IBUS1_ACS_NXTLVL_RD_CNT_REG register
 *  L1-ICache bus1 Next-Level-Access Counter register
 */
#define CACHE_L1_IBUS1_ACS_NXTLVL_RD_CNT_REG (DR_REG_CACHE_BASE + 0x1a0)
/** CACHE_L1_IBUS1_NXTLVL_RD_CNT : RO; bitpos: [31:0]; default: 0;
 *  The register records the number of times that L1-ICache accesses L2-Cache due to
 *  bus1 accessing L1-ICache1.
 */
#define CACHE_L1_IBUS1_NXTLVL_RD_CNT    0xFFFFFFFFU
#define CACHE_L1_IBUS1_NXTLVL_RD_CNT_M  (CACHE_L1_IBUS1_NXTLVL_RD_CNT_V << CACHE_L1_IBUS1_NXTLVL_RD_CNT_S)
#define CACHE_L1_IBUS1_NXTLVL_RD_CNT_V  0xFFFFFFFFU
#define CACHE_L1_IBUS1_NXTLVL_RD_CNT_S  0

/** CACHE_L1_DBUS0_ACS_HIT_CNT_REG register
 *  L1-DCache bus0 Hit-Access Counter register
 */
#define CACHE_L1_DBUS0_ACS_HIT_CNT_REG (DR_REG_CACHE_BASE + 0x1c4)
/** CACHE_L1_DBUS0_HIT_CNT : RO; bitpos: [31:0]; default: 0;
 *  The register records the number of hits when bus0 accesses L1-DCache.
 */
#define CACHE_L1_DBUS0_HIT_CNT    0xFFFFFFFFU
#define CACHE_L1_DBUS0_HIT_CNT_M  (CACHE_L1_DBUS0_HIT_CNT_V << CACHE_L1_DBUS0_HIT_CNT_S)
#define CACHE_L1_DBUS0_HIT_CNT_V  0xFFFFFFFFU
#define CACHE_L1_DBUS0_HIT_CNT_S  0

/** CACHE_L1_DBUS0_ACS_MISS_CNT_REG register
 *  L1-DCache bus0 Miss-Access Counter register
 */
#define CACHE_L1_DBUS0_ACS_MISS_CNT_REG (DR_REG_CACHE_BASE + 0x1c8)
/** CACHE_L1_DBUS0_MISS_CNT : RO; bitpos: [31:0]; default: 0;
 *  The register records the number of missing when bus0 accesses L1-DCache.
 */
#define CACHE_L1_DBUS0_MISS_CNT    0xFFFFFFFFU
#define CACHE_L1_DBUS0_MISS_CNT_M  (CACHE_L1_DBUS0_MISS_CNT_V << CACHE_L1_DBUS0_MISS_CNT_S)
#define CACHE_L1_DBUS0_MISS_CNT_V  0xFFFFFFFFU
#define CACHE_L1_DBUS0_MISS_CNT_S  0

/** CACHE_L1_DBUS0_ACS_CONFLICT_CNT_REG register
 *  L1-DCache bus0 Conflict-Access Counter register
 */
#define CACHE_L1_DBUS0_ACS_CONFLICT_CNT_REG (DR_REG_CACHE_BASE + 0x1cc)
/** CACHE_L1_DBUS0_CONFLICT_CNT : RO; bitpos: [31:0]; default: 0;
 *  The register records the number of access-conflicts when bus0 accesses L1-DCache.
 */
#define CACHE_L1_DBUS0_CONFLICT_CNT    0xFFFFFFFFU
#define CACHE_L1_DBUS0_CONFLICT_CNT_M  (CACHE_L1_DBUS0_CONFLICT_CNT_V << CACHE_L1_DBUS0_CONFLICT_CNT_S)
#define CACHE_L1_DBUS0_CONFLICT_CNT_V  0xFFFFFFFFU
#define CACHE_L1_DBUS0_CONFLICT_CNT_S  0

/** CACHE_L1_DBUS0_ACS_NXTLVL_RD_CNT_REG register
 *  L1-DCache bus0 Next-Level-Access Counter register
 */
#define CACHE_L1_DBUS0_ACS_NXTLVL_RD_CNT_REG (DR_REG_CACHE_BASE + 0x1d0)
/** CACHE_L1_DBUS0_NXTLVL_RD_CNT : RO; bitpos: [31:0]; default: 0;
 *  The register records the number of times that L1-DCache accesses L2-Cache due to
 *  bus0 accessing L1-DCache.
 */
#define CACHE_L1_DBUS0_NXTLVL_RD_CNT    0xFFFFFFFFU
#define CACHE_L1_DBUS0_NXTLVL_RD_CNT_M  (CACHE_L1_DBUS0_NXTLVL_RD_CNT_V << CACHE_L1_DBUS0_NXTLVL_RD_CNT_S)
#define CACHE_L1_DBUS0_NXTLVL_RD_CNT_V  0xFFFFFFFFU
#define CACHE_L1_DBUS0_NXTLVL_RD_CNT_S  0

/** CACHE_L1_DBUS0_ACS_NXTLVL_WR_CNT_REG register
 *  L1-DCache bus0 WB-Access Counter register
 */
#define CACHE_L1_DBUS0_ACS_NXTLVL_WR_CNT_REG (DR_REG_CACHE_BASE + 0x1d4)
/** CACHE_L1_DBUS0_NXTLVL_WR_CNT : RO; bitpos: [31:0]; default: 0;
 *  The register records the number of write back when bus0 accesses L1-DCache.
 */
#define CACHE_L1_DBUS0_NXTLVL_WR_CNT    0xFFFFFFFFU
#define CACHE_L1_DBUS0_NXTLVL_WR_CNT_M  (CACHE_L1_DBUS0_NXTLVL_WR_CNT_V << CACHE_L1_DBUS0_NXTLVL_WR_CNT_S)
#define CACHE_L1_DBUS0_NXTLVL_WR_CNT_V  0xFFFFFFFFU
#define CACHE_L1_DBUS0_NXTLVL_WR_CNT_S  0

